package homework;

public class HomeWork2 {
    //    Домашнее задание №2
//Написать метод, принимающий на вход два целых числа и проверяющий, что их сумма лежит в пределах от 10 до 20 (включительно), если да – вернуть true, в противном случае – false.
////
////
////
//    public static boolean twoNumbers(int a, int b) {
//        return a + b >= 10 && a + b <= 20;
//    }
//
//    //Написать метод, которому в качестве параметра передается целое число, метод должен напечатать в консоль, положительное ли число передали или отрицательное.
//// Замечание: ноль считаем положительным числом.
//    public static void valueNumber(int a) {
//        if (a >= 0) System.out.println ("Число положительное");
//        else System.out.println ("Число отрицательное");
//    }
//
//    //Написать метод, которому в качестве параметра передается целое число. Метод должен вернуть true, если число отрицательное, и вернуть false если положительное.
//    public static boolean isNegative(int x) {
//        if (x >= 0) {
//            return false;
//        } else return true;
//        }
//
//
////    //Написать метод, которому в качестве аргументов передается строка и число, метод должен отпечатать в консоль указанную строку, указанное количество раз;
////    public static void printWordMulti(String c, int i) {
////        for (i = i; i <= 20; i *= 2) {
////            System.out.println (c);
////        }
////    }
//public static void printWordMulti(String c, int n) {
//    for (int i = 0; i <n; i++) {
//        System.out.println (c);
//    }
//}
//
//    //* Написать метод, который определяет, является ли год високосным, и возвращает boolean (високосный - true, не високосный - false).
//    // Каждый 4-й год является високосным, кроме каждого 100-го, при этом каждый 400-й – високосный.
//    public static boolean isYear(int year) {
//        if (year % 100 != 0 && year % 4 == 0|| year % 400 == 0) {
//            return true;
//        } else return false;
////    }
//    public static void invertArray() {
//        int[] arr = {1, 1, 0, 0, 1, 0, 1, 1, 0, 0};
//        for (int i = 0; i < arr.length; i++) {
//            if (arr[i] == 0) {
//                arr[i] = 1;
//            }
//            else { arr[i] = 0;}
//            System.out.println (Arrays.toString (arr));
//        }
//    }
}
